import re  # імпортую модуль

a = input("Привіт, розкажи про себе: ")  # інформація про юзера
b = (a.lower())  # виконуємо все з маленької букви
c = re.sub("[.|,|-|:|;|?|!]", "", b)  # підглянув цей спосіб у гугл))
d = (c.rstrip("\t"))  # видаляю таб справа
d1 = (c.rstrip(" "))  # видаляю пробіл справа
print(d1)  # виводить відредактований текст

e = input("Що бажаєте замінити: ")  # очікує інфи від юзера
e0 = d1.find(e)  # знаходить індекс
print(f"Знайдено у індексі {e0}")
e1 = input("На яке слово хочете замінити: ")  # очікує інфи від юзера
f = d1.replace(e, e1)  # замінює необхідне
print(f)  # виводить відредактований текст

# код очень кривой) особенно я не понимаю как работает поиск по индексу почему оно показівет именно эти цифры
# и гит хаб - это ад)
